package algorithms.simplesorting.insertsort;

public class ArrayIns {
    private long[] a;                           // Ссылка на массив a
    private int nElems;                         // Количество элементов данных
    //----------------------------------------------------------------------------
    public ArrayIns(int max) {                  // Конструктор
        a = new long[max];                      // Создание массива
        nElems = 0;                             // Пока нет ни одного элемента
    }
//----------------------------------------------------------------------------
    public void insert(long value) {            // Вставка элемента в массив
        a[nElems] = value;                      // Вставка
        nElems++;                               // Увеличение размера
    }
//----------------------------------------------------------------------------
    public void display() {                     // Вывод содержимого массива
        for(int j = 0; j < nElems; j++) {       // Для каждого элемента
            System.out.print(a[j] + " ");     // Вывод
        }
        System.out.println();
    }
//----------------------------------------------------------------------------
    public void insertionSort() {
        int in, out;

        for(out = 1; out < nElems; out++) {             // out - разделительный маркер
            long temp = a[out];                         // скопировать помеченный элемент
            in = out;                                   // начать перемещения с out

            while(in > 0 && a[in-1] >= temp) {          // пока не найден меньший элемент
                a[in] = a[in-1];                        // сдвинуть элемент вправо
                --in;                                   // перейти на одну позицию влево
            }

            a[in] = temp;                               // вставить помеченный элемент
        }
    }
}
